data/c_epoll_500_1.txt
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /echo/HELLO
Document Length:        5 bytes

Concurrency Level:      500
Time taken for tests:   32.207 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      690000 bytes
HTML transferred:       50000 bytes
Requests per second:    310.49 [#/sec] (mean)
Time per request:       1610.367 [ms] (mean)
Time per request:       3.221 [ms] (mean, across all concurrent requests)
Transfer rate:          20.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       37  574 757.9    120   11234
Processing:    39  375 1103.3     98   31830
Waiting:       39  369 1092.6     98   31830
Total:         83  949 1344.8    431   31919

Percentage of the requests served within a certain time (ms)
  50%    431
  66%   1156
  75%   1198
  80%   1287
  90%   2176
  95%   3130
  98%   4183
  99%   5714
 100%  31919 (longest request)